The-Challenger-website/app/views/challenges/index.html.erb

SELECT "challenges".* FROM "challenges"
---
<!-- select :category,  -->
<!--   <p><= options_from_collection_for_select(Challenge.all, "id", "category"), include_blank: true, :prompt => "Find Challenges by Category", :selected => @category %></p> -->

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
      <% if @block.nil? %>
        <% @challenge_owner = User.find(challenge.user1_id) %>