The-Challenger-website/app/views/comments/_comment.html.erb


        <% @user =  User.find(comment.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]