The-Challenger-website/app/views/comments/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."challenge_id" = ?  [["challenge_id", 1]]
---

<% @challenge.comments.each do |comment| %>