The-Challenger-website/app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def set_search
    @search = Challenge.search(params[:q])

INSERT INTO "challenges" ("name", "path", "upload_type", "user1_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @challenge = Challenge.new(challenge_params)
    @challenge.user1_id = current_user.id
      if @challenge.save

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 2]]
---
  def destroy
    @challenge = Challenge.find(params[:id])
    @notifications = Notification.all
    @notifications.each do |notification|
      if notification.challenge_id == @challenge.id
        @notification = Notification.find(notification.id)
        if @notification.seen == false
          @user = User.find(@notification.sent_to)
          @user.decrement(:notifications, 1)
          @user.save
        end
        @notification.destroy
      end
    end
    @challenge.destroy

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @challenge = Challenge.find(params[:id])