The-Challenger-website/app/controllers/comments_controller.rb

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("text", "challenge_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "hiii"], ["challenge_id", 1], ["created_at", "2015-04-06 05:41:14.159804"], ["updated_at", "2015-04-06 05:41:14.159804"]]
---
	def create
    @challenge = Challenge.find(params[:challenge_id])
    @user = User.find(current_user.id)
    @comment = @challenge.comments.create(comment_params)

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", 1]]
---
 	def index
 	  @challenge = Challenge.find(params[:challenge_id])