The-Challenger-website/app/controllers/profile_controller.rb

	def show
     @user = current_user
     @challenges = Challenge.all
---
SELECT "challenges".* FROM "challenges"