The-Challenger-website/app/controllers/users_controller.rb

	def show
    @user = User.find(params[:id])
    @challenges = Challenge.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "challenges".* FROM "challenges"