The-Challenger-website/app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
      <% @challenges.each do |challenge| %>
       <% @challenge_owner = User.find(challenge.user1_id) %>